In [34]:
import numpy as np
import pandas as pd

In [89]:
df = pd.read_csv('./other_train.csv', sep=',', index_col=0) # First column is Unnamed
for column_name in df:
    if df[column_name].dtypes == 'object':
        df[column_name] = df[column_name].str.strip()

,name,address,race,marital-status,occupation,pregnant,education-num,relationship,skewness_glucose,mean_glucose,...,education,fnlwgt,class,std_glucose,income,medical_info,native-country,hours-per-week,capital-loss,workclass
0,David Hayes,235 Jennifer Throughway Suite 569\r\nNew Antho...,Black,??,Prof-specialty,f,5.0,Not-in-family,-0.197692,141.359375,...,9th,175431.0,0.0,49.842053,<=50K,"{'mean_oxygen':'4.04264214','std_oxygen':'19.4...",United-States,40.0,0.0,Private
1,Stanley Benny,"08954 Johnson Course\r\nNew Lauraville, NV 22019",White,Married-civ-spouse,Exec-managerial,f,13.0,Husband,16.019670,53.968750,...,Bachelors,66473.0,1.0,31.900220,>50K,"{'mean_oxygen':'9.294314381','std_oxygen':'35....",United-States,40.0,0.0,Private
2,Domingo Labriola,"36319 Wiley Drive Suite 094\r\nSouth Michael, ...",Asian-Pac-Islander,Married-civ-spouse,Farming-fishing,f,3.0,Husband,21.803837,2257.812500,...,5th-6th,93206.0,1.0,35.793158,<=50K,"{'mean_oxygen':'138.7876254','std_oxygen':'79....",Philippines,40.0,0.0,Private
3,Ronnie Moore,"0755 Soto Oval Apt. 443\r\nWest Markside, TX 3...",White,Never-married,Other-service,FALSE,10.0,Not-in-family,-0.112191,110.046875,...,Some-college,137604.0,0.0,53.876575,<=50K,"{'mean_oxygen':'3.100334448','std_oxygen':'17....",United-States,40.0,0.0,Private
4,Victor Mcjunkin,"95738 Keller Overpass\r\nKennedyland, MO 71071",White,NaN,Adm-clerical,f,10.0,Not-in-family,-0.309642,137.960938,...,Some-college,174592.0,0.0,51.885451,<=50K,"{'mean_oxygen':'4.203177258','std_oxygen':'23....",United-States,40.0,0.0,Private

In [90]:
df.info()
# There are 22 columns. 10 atributes are float type and 12 are object.
# All columns expect name and adress have null values

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3983 entries, 0 to 3982
Data columns (total 22 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   name              3983 non-null   object
 1   address           3983 non-null   object
 2   race              3971 non-null   object
 3   marital-status    3709 non-null   object
 4   occupation        3968 non-null   object
 5   pregnant          3967 non-null   object
 6   education-num     3971 non-null   float64
 7   relationship      3972 non-null   object
 8   skewness_glucose  3968 non-null   float64
 9   mean_glucose      3974 non-null   float64
 10  capital-gain      3964 non-null   float64
 11  kurtosis_glucose  3970 non-null   float64
 12  education         3969 non-null   object
 13  fnlwgt            3965 non-null   float64
 14  class             3972 non-null   float64
 15  std_glucose       3966 non-null   float64
 16  income            3971 non-null   object
 17  medical_info      3967 non-null   object
 18  native-country    3967 non-null   object
 19  hours-per-week    3971 non-null   float64
 20  capital-loss      3971 non-null   float64
 21  workclass         3968 non-null   object
dtypes: float64(10), object(12)
memory usage: 715.7+ KB

In [91]:
df.describe()

,education-num,skewness_glucose,mean_glucose,capital-gain,kurtosis_glucose,fnlwgt,class,std_glucose,hours-per-week,capital-loss
count,3971.000000,3968.000000,3974.000000,3964.000000,3970.000000,3.965000e+03,3972.000000,3966.000000,3971.000000,3971.000000
mean,10.065223,4.233223,69.173141,1228.128406,0.952248,1.911784e+05,0.256294,45.172793,40.505162,73.254092
std,2.671998,9.715162,3348.917032,8623.958204,1.614087,1.072410e+05,0.436641,7.621144,12.279149,369.551911
min,1.000000,-1.755332,-18973.437500,0.000000,-1.641515,1.882700e+04,0.000000,25.695250,1.000000,0.000000
25%,9.000000,-0.120081,83.955078,0.000000,0.070311,1.179830e+05,0.000000,40.151488,40.000000,0.000000
50%,10.000000,0.376026,110.613281,0.000000,0.311092,1.795090e+05,0.000000,45.878359,40.000000,0.000000
75%,13.000000,2.090854,125.382812,0.000000,0.776492,2.415230e+05,1.000000,50.350939,45.000000,0.000000
max,16.000000,68.101622,15887.500000,99999.000000,8.069522,1.366120e+06,1.000000,91.206475,99.000000,2824.000000

In [92]:
df.head()

,name,address,race,marital-status,occupation,pregnant,education-num,relationship,skewness_glucose,mean_glucose,...,education,fnlwgt,class,std_glucose,income,medical_info,native-country,hours-per-week,capital-loss,workclass
0,David Hayes,235 Jennifer Throughway Suite 569\r\nNew Antho...,Black,??,Prof-specialty,f,5.0,Not-in-family,-0.197692,141.359375,...,9th,175431.0,0.0,49.842053,<=50K,"{'mean_oxygen':'4.04264214','std_oxygen':'19.4...",United-States,40.0,0.0,Private
1,Stanley Benny,"08954 Johnson Course\r\nNew Lauraville, NV 22019",White,Married-civ-spouse,Exec-managerial,f,13.0,Husband,16.019670,53.968750,...,Bachelors,66473.0,1.0,31.900220,>50K,"{'mean_oxygen':'9.294314381','std_oxygen':'35....",United-States,40.0,0.0,Private
2,Domingo Labriola,"36319 Wiley Drive Suite 094\r\nSouth Michael, ...",Asian-Pac-Islander,Married-civ-spouse,Farming-fishing,f,3.0,Husband,21.803837,2257.812500,...,5th-6th,93206.0,1.0,35.793158,<=50K,"{'mean_oxygen':'138.7876254','std_oxygen':'79....",Philippines,40.0,0.0,Private
3,Ronnie Moore,"0755 Soto Oval Apt. 443\r\nWest Markside, TX 3...",White,Never-married,Other-service,FALSE,10.0,Not-in-family,-0.112191,110.046875,...,Some-college,137604.0,0.0,53.876575,<=50K,"{'mean_oxygen':'3.100334448','std_oxygen':'17....",United-States,40.0,0.0,Private
4,Victor Mcjunkin,"95738 Keller Overpass\r\nKennedyland, MO 71071",White,NaN,Adm-clerical,f,10.0,Not-in-family,-0.309642,137.960938,...,Some-college,174592.0,0.0,51.885451,<=50K,"{'mean_oxygen':'4.203177258','std_oxygen':'23....",United-States,40.0,0.0,Private

In [93]:
df['address'] # We can separate address into three different columns(street, city, zip_code)

0       235 Jennifer Throughway Suite 569\r\nNew Antho...
1        08954 Johnson Course\r\nNew Lauraville, NV 22019
2       36319 Wiley Drive Suite 094\r\nSouth Michael, ...
3       0755 Soto Oval Apt. 443\r\nWest Markside, TX 3...
4          95738 Keller Overpass\r\nKennedyland, MO 71071
                              ...
3978    7401 Donaldson Lake Apt. 338\r\nPort Wayneview...
3979    7060 Tammy Greens Apt. 475\r\nEast Michael, KS...
3980           75021 Bishop Pass\r\nLake Rachel, ID 91709
3981    81727 Rubio Rapids Apt. 057\r\nLawsonburgh, NM...
3982          953 Caldwell Mount\r\nPort Willie, MS 14959
Name: address, Length: 3983, dtype: object

In [94]:
df['race'].unique() # Can we change Other to nan or vice-versa?

array(['Black', 'White', 'Asian-Pac-Islander', 'Other', nan,
       'Amer-Indian-Eskimo'], dtype=object)

In [95]:
df['marital-status'].value_counts() # We can change '??' values to nan

Married-civ-spouse       1680
Never-married            1180
Divorced                  439
??                        139
Widowed                   111
Separated                 109
Married-spouse-absent      49
Married-AF-spouse           2
Name: marital-status, dtype: int64

In [96]:
df['marital-status'] = df['marital-status'].replace('??', np.nan)
df['marital-status'].value_counts() # We have succesfully replaced '??' values with NaN

Married-civ-spouse       1680
Never-married            1180
Divorced                  439
Widowed                   111
Separated                 109
Married-spouse-absent      49
Married-AF-spouse           2
Name: marital-status, dtype: int64

In [97]:
df['occupation'].value_counts() # Again we can replace '?' values with NaN

Craft-repair         512
Prof-specialty       499
Exec-managerial      492
Adm-clerical         472
Other-service        424
Sales                423
Machine-op-inspct    228
?                    224
Transport-moving     192
Handlers-cleaners    177
Farming-fishing      119
Tech-support         115
Protective-serv       72
Priv-house-serv       19
Name: occupation, dtype: int64

In [98]:
df['occupation'] = df['occupation'].replace('?', np.nan)
df['occupation'].value_counts() # We have succesfully replaced '?' values with NaN

Craft-repair         512
Prof-specialty       499
Exec-managerial      492
Adm-clerical         472
Other-service        424
Sales                423
Machine-op-inspct    228
Transport-moving     192
Handlers-cleaners    177
Farming-fishing      119
Tech-support         115
Protective-serv       72
Priv-house-serv       19
Name: occupation, dtype: int64

In [99]:
# Replace 'f', 'F' and "FALSE" with one stable value "False", apply same method for "True"
df['pregnant'].value_counts()

f        3503
F         194
FALSE     192
t          69
TRUE        5
T           4
Name: pregnant, dtype: int64

In [100]:
df['pregnant'] = df['pregnant'].replace(['f', 'F', 'FALSE'], 'False')
df['pregnant'] = df['pregnant'].replace(['t', 'T', 'TRUE'], 'True')
df['pregnant'].value_counts()

False    3889
True       78
Name: pregnant, dtype: int64

In [101]:
df['education-num'].value_counts() # This column is OK I guess

9.0     1249
10.0     870
13.0     663
14.0     220
11.0     188
7.0      138
6.0      109
12.0     103
4.0       97
15.0      82
5.0       74
16.0      54
3.0       52
8.0       44
2.0       17
1.0       11
Name: education-num, dtype: int64

In [102]:
df['relationship'].value_counts() # There are multiple same values, but they are written differently, so we can fix it
df['relationship'].unique()

array(['Not-in-family', 'Husband', 'Own-child', 'Not_in_family',
       'Unmarried', 'Own_child', 'Wife', 'Other-relative', nan,
       'Other_relative'], dtype=object)

In [103]:
df['relationship'] = df['relationship'].replace('Not_in_family', 'Not-in-family')
df['relationship'] = df['relationship'].replace('Own_child', 'Own-child')
df['relationship'] = df['relationship'].replace('Other_relative', 'Other-relative')
df['relationship'].value_counts()

Husband           1630
Not-in-family      998
Own-child          588
Unmarried          427
Wife               205
Other-relative     124
Name: relationship, dtype: int64

In [107]:
df['skewness_glucose'].value_counts() # Maybe we can round this numbers?

-0.458587     2
 0.396490     2
 0.165603     2
 3.673929     2
 36.104846    2
             ..
 0.228760     1
-0.119966     1
-1.469010     1
 24.270634    1
 39.078306    1
Name: skewness_glucose, Length: 3932, dtype: int64

In [108]:
df['mean_glucose'].value_counts() # Maybe we can round this numbers

 123.031250     4
 124.546875     4
 108.968750     4
 128.218750     4
 122.968750     3
               ..
 88.179688      1
-8657.812500    1
 84.210938      1
 68.234375      1
 124.000000     1
Name: mean_glucose, Length: 3449, dtype: int64

In [109]:
df['education'].value_counts() # OK?

HS-grad         1246
Some-college     869
Bachelors        662
Masters          220
Assoc-voc        188
11th             137
10th             109
Assoc-acdm       103
7th-8th           99
Prof-school       82
9th               75
Doctorate         54
5th-6th           52
12th              45
1st-4th           17
Preschool         11
Name: education, dtype: int64

In [111]:
df['fnlwgt'].value_counts() # change name of the column, but what means fnlwgt

113364.0    4
144064.0    4
34180.0     4
161141.0    4
123983.0    4
           ..
179594.0    1
33619.0     1
285335.0    1
222539.0    1
28160.0     1
Name: fnlwgt, Length: 3671, dtype: int64

In [112]:
df['class'].value_counts() # This can be integer

0.0    2954
1.0    1018
Name: class, dtype: int64

In [114]:
df['std_glucose'].value_counts() # Mayber round

56.678746    2
46.336825    2
30.322605    2
42.872164    2
49.762971    2
            ..
52.244316    1
58.893506    1
52.811404    1
51.129297    1
36.876648    1
Name: std_glucose, Length: 3929, dtype: int64

In [116]:
df['income'].value_counts() # OK

array(['<=50K', '>50K', nan], dtype=object)

In [118]:
df['medical_info'].value_counts() # separate this into different columns?

{'mean_oxygen':'2.245819398','std_oxygen':'18.91000799','kurtosis_oxygen':'10.47705862','skewness_oxygen':'117.95612959999998'}    2
{'mean_oxygen':'2.81270903','std_oxygen':'18.13688307','kurtosis_oxygen':'7.859968426','skewness_oxygen':'71.29944944'}            2
{'mean_oxygen':'109.1831104','std_oxygen':'53.13709551','kurtosis_oxygen':'0.871270859','skewness_oxygen':'0.488218105'}           2
{'mean_oxygen':'1.785117057','std_oxygen':'17.9354047','kurtosis_oxygen':'10.76379769','skewness_oxygen':'121.1406569'}            2
{'mean_oxygen':'2.673076923','std_oxygen':'15.56239929','kurtosis_oxygen':'8.785771755','skewness_oxygen':'97.52747517'}           2
                                                                                                                                  ..
{'mean_oxygen':'1.056020067','std_oxygen':'12.01870221','kurtosis_oxygen':'14.18799037','skewness_oxygen':'234.0608365'}           1
{'mean_oxygen':'13.01505017','std_oxygen':'42.23346215','kurtosis_oxygen':'3.367500923','skewness_oxygen':'10.69252837'}           1
{'mean_oxygen':'2.515050167','std_oxygen':'16.74910094','kurtosis_oxygen':'7.85718748','skewness_oxygen':'73.64042996'}            1
{'mean_oxygen':'1.826923077','std_oxygen':'16.451133','kurtosis_oxygen':'10.11596988','skewness_oxygen':'111.4821508'}             1
{'mean_oxygen':'4.096153846','std_oxygen':'24.52641642','kurtosis_oxygen':'6.318928586','skewness_oxygen':'40.93901278'}           1
Name: medical_info, Length: 3932, dtype: int64

In [119]:
df['native-country'].value_counts() # replace '?' with NaN

United-States         3554
Mexico                  86
?                       58
Philippines             25
Germany                 17
India                   15
Canada                  14
Guatemala               13
Puerto-Rico             11
Japan                   11
Jamaica                 11
Cuba                    11
Taiwan                  10
Dominican-Republic      10
China                   10
England                 10
Italy                   10
South                    9
El-Salvador              9
Poland                   8
Vietnam                  7
Nicaragua                6
Trinadad&Tobago          5
Haiti                    5
Laos                     5
Scotland                 5
Peru                     4
Columbia                 4
Ecuador                  4
Iran                     3
Portugal                 3
Hong                     3
Hungary                  2
Honduras                 2
France                   2
Greece                   2
Cambodia                 2
Thailand                 1
Name: native-country, dtype: int64

In [120]:
df['native-country'] = df['native-country'].replace('?', np.nan)
df['native-country'].value_counts() # # We have succesfully replaced '?' values with NaN

United-States         3554
Mexico                  86
Philippines             25
Germany                 17
India                   15
Canada                  14
Guatemala               13
Puerto-Rico             11
Japan                   11
Jamaica                 11
Cuba                    11
China                   10
Taiwan                  10
Dominican-Republic      10
Italy                   10
England                 10
El-Salvador              9
South                    9
Poland                   8
Vietnam                  7
Nicaragua                6
Scotland                 5
Laos                     5
Haiti                    5
Trinadad&Tobago          5
Peru                     4
Ecuador                  4
Columbia                 4
Portugal                 3
Hong                     3
Iran                     3
Honduras                 2
Greece                   2
Hungary                  2
Cambodia                 2
France                   2
Thailand                 1
Name: native-country, dtype: int64

In [121]:
df['hours-per-week'].value_counts() # OK

40.0    1860
50.0     359
45.0     208
60.0     173
35.0     160
        ...
29.0       1
81.0       1
67.0       1
68.0       1
77.0       1
Name: hours-per-week, Length: 76, dtype: int64

In [122]:
df['capital-loss'].value_counts() # OK

0.0       3815
1887.0      23
1977.0      22
1902.0      15
2415.0      10
1590.0       7
1485.0       7
1876.0       5
1848.0       5
1741.0       3
2258.0       3
2042.0       3
1740.0       3
1980.0       3
1092.0       3
1672.0       3
1628.0       2
1721.0       2
1504.0       2
1579.0       2
1594.0       2
2339.0       2
323.0        2
2377.0       2
1719.0       2
2174.0       2
2444.0       2
2179.0       1
1408.0       1
1258.0       1
1380.0       1
625.0        1
2057.0       1
2051.0       1
880.0        1
2002.0       1
1573.0       1
1762.0       1
1602.0       1
1669.0       1
2603.0       1
2352.0       1
1617.0       1
2559.0       1
2824.0       1
2392.0       1
Name: capital-loss, dtype: int64

In [123]:
df['workclass'].value_counts() # Again we can replace '?' with NaN

Private             2770
Self-emp-not-inc     293
Local-gov            260
?                    227
State-gov            150
Self-emp-inc         142
Federal-gov          124
Without-pay            2
Name: workclass, dtype: int64

In [125]:
df['workclass'] = df['workclass'].replace('?', np.nan)
df['workclass'].value_counts()

Private             2770
Self-emp-not-inc     293
Local-gov            260
State-gov            150
Self-emp-inc         142
Federal-gov          124
Without-pay            2
Name: workclass, dtype: int64